{
  "Awareness": {
    "definition": "Awareness denotes the baseline conscious registration of internal and external stimuli, reflecting widespread cortical integration of sensory and contextual information.",
    "functional_role": "It establishes the experiential field within which other cognitive operations unfold, enabling organisms to orient toward salient events.",
    "symbolic_resonance": "Stabilizes the Cx-field, harmonizing global conscious coherence with G-field presence.",
    "example": "Noticing the ambient hum of a room while simultaneously sensing your posture and mood."
  },
  "Attention": {
    "definition": "Attention is the selective allocation of cognitive resources that amplifies relevant signals while suppressing distractors through fronto-parietal control networks.",
    "functional_role": "It prioritizes processing for goal-relevant stimuli, enhancing perception, working memory, and decision efficiency.",
    "symbolic_resonance": "Channels G-field focus into R-field alignment, producing directed engagement.",
    "example": "Focusing on a lecturer’s voice despite background chatter."
  },
  "Perception (Visual)": {
    "definition": "Visual perception transforms photic input into structured representations via hierarchical analysis in occipital-temporal pathways.",
    "functional_role": "It delivers spatial, object, and motion information critical for navigation, recognition, and planning.",
    "symbolic_resonance": "Maps the P-field with Cx-field clarity, projecting external form into internal schema.",
    "example": "Recognizing a friend’s face across a crowded plaza."
  },
  "Perception (Auditory)": {
    "definition": "Auditory perception decodes acoustic waveforms into meaningful patterns through temporal cortex processing and auditory association circuits.",
    "functional_role": "It enables speech comprehension, environmental monitoring, and rhythmic entrainment.",
    "symbolic_resonance": "Infuses the P-field with T-field cadence, translating vibrational patterns into comprehension.",
    "example": "Distinguishing a bird’s song and interpreting it as a sign of spring."
  },
  "Perception (Somatosensory)": {
    "definition": "Somatosensory perception integrates tactile, nociceptive, and temperature cues via the somatosensory cortex to represent bodily contact and surface states.",
    "functional_role": "It supports manipulation, protection, and embodiment by informing about touch, pain, and texture.",
    "symbolic_resonance": "Grounds the P-field in corporeal feedback, reinforcing the Id-field boundary.",
    "example": "Feeling the warmth and grain of a wooden railing under your hand."
  },
  "Interoception": {
    "definition": "Interoception is the monitoring of internal physiological signals such as heartbeat, respiration, and visceral states mediated by insular and brainstem circuits.",
    "functional_role": "It anchors emotional appraisal and homeostatic regulation, contributing to self-awareness.",
    "symbolic_resonance": "Binds the A-field with Cx-field coherence, harmonizing bodily sensation and conscious appraisal.",
    "example": "Sensing your stomach tighten before giving a presentation."
  },
  "Proprioception": {
    "definition": "Proprioception is the perception of limb position and movement generated by muscle spindle and joint receptor input integrated in parietal cortices.",
    "functional_role": "It calibrates coordinated movement, posture, and spatial orientation without visual guidance.",
    "symbolic_resonance": "Couples the P-field with T-field stability, sustaining embodied alignment.",
    "example": "Typing on a keyboard without looking at your hands."
  },
  "Arousal / Vigilance": {
    "definition": "Arousal is the modulation of neural responsiveness by ascending reticular activating systems that set global alertness levels.",
    "functional_role": "It determines readiness for information processing and response, influencing attention and learning.",
    "symbolic_resonance": "Energizes the G-field, sustaining systemic activation across fields.",
    "example": "Feeling alert and responsive after a sudden loud noise."
  },
  "Working Memory": {
    "definition": "Working memory is the limited-capacity system that transiently stores and manipulates information via prefrontal-parietal circuitry.",
    "functional_role": "It supports reasoning, language comprehension, and goal-directed behavior by holding task-relevant content online.",
    "symbolic_resonance": "Maintains structured R-field sequences within the Cx-field nexus.",
    "example": "Remembering a phone number long enough to dial it."
  },
  "Episodic Memory": {
    "definition": "Episodic memory encodes and retrieves autobiographical events through hippocampal-cortical interactions, retaining temporal-spatial context.",
    "functional_role": "It enables reconstruction of past experiences to guide identity and future planning.",
    "symbolic_resonance": "Weaves Id-field narrative threads across T-field chronology.",
    "example": "Recalling the details of your last vacation."
  },
  "Semantic Memory": {
    "definition": "Semantic memory stores decontextualized knowledge about facts, concepts, and language supported by distributed neocortical networks.",
    "functional_role": "It provides conceptual frameworks that ground understanding and inference.",
    "symbolic_resonance": "Stabilizes the Cx-field lattice with R-field conceptual structure.",
    "example": "Knowing that Paris is the capital of France."
  },
  "Language / Symbolics": {
    "definition": "Language processing orchestrates phonological, syntactic, and semantic operations across perisylvian cortex to encode and decode symbolic communication.",
    "functional_role": "It enables abstract thought, interpersonal exchange, and cultural transmission.",
    "symbolic_resonance": "Transduces R-field codes through the Cx-field medium into shared meaning.",
    "example": "Formulating a sentence to explain your reasoning during a debate."
  },
  "Imagination / Visualization": {
    "definition": "Imagination recruits default mode and visual association networks to simulate sensory experiences without current external input.",
    "functional_role": "It allows mental rehearsal, creative ideation, and hypothesis testing.",
    "symbolic_resonance": "Projects Cx-field constructs into P-field imagery, expanding potential states.",
    "example": "Mentally picturing how furniture will look in a new apartment."
  },
  "Mental Time Travel": {
    "definition": "Mental time travel is the capacity to reconstruct past events and pre-experience future scenarios by flexibly navigating episodic representations.",
    "functional_role": "It supports planning, learning from experience, and maintaining autobiographical continuity.",
    "symbolic_resonance": "Traverses T-field arcs, synchronizing Id-field continuity across time.",
    "example": "Reliving a childhood memory while anticipating how a reunion might unfold."
  },
  "Planning / Prospection": {
    "definition": "Planning involves prefrontal circuitry generating ordered action sequences to achieve future goals based on predictive models.",
    "functional_role": "It organizes behavior over time, allocating resources and contingencies.",
    "symbolic_resonance": "Aligns R-field strategy with T-field foresight, informing Cx-field directives.",
    "example": "Mapping out tasks and deadlines to complete a project on schedule."
  },
  "Decision-Making": {
    "definition": "Decision-making integrates value, risk, and outcome representations via prefrontal, striatal, and limbic systems to select actions.",
    "functional_role": "It resolves competing options to guide behavior toward desired ends.",
    "symbolic_resonance": "Balances N-field evaluation with A-field salience, yielding Cx-field choice.",
    "example": "Weighing job offers by comparing salary, location, and growth opportunities."
  },
  "Inhibition / Self-Control": {
    "definition": "Inhibition is the top-down suppression of prepotent responses mediated by prefrontal control networks.",
    "functional_role": "It prevents impulsive actions, enabling goal-consistent behavior.",
    "symbolic_resonance": "Moderates A-field impulses within the R-field governance lattice.",
    "example": "Resisting the urge to check your phone during a meeting."
  },
  "Cognitive Flexibility": {
    "definition": "Cognitive flexibility is the ability to adapt thinking and behavior in response to shifting rules or perspectives, driven by fronto-striatal circuits.",
    "functional_role": "It enables problem-solving, creativity, and resilience to change.",
    "symbolic_resonance": "Allows smooth transitions across R-field configurations while preserving Cx-field coherence.",
    "example": "Switching strategies when a familiar approach fails during a puzzle."
  },
  "Meta-Awareness": {
    "definition": "Meta-awareness involves monitoring one’s own cognitive and affective states, supported by anterior prefrontal and insular regions.",
    "functional_role": "It facilitates self-regulation, error detection, and mindful recalibration.",
    "symbolic_resonance": "Creates a reflective loop within the Cx-field, surveying G-field dynamics.",
    "example": "Noticing that your attention has wandered during meditation and gently returning focus."
  },
  "Self-Model / Identity": {
    "definition": "The self-model is the integrated representation of personal traits, memories, and roles maintained by medial prefrontal and temporoparietal networks.",
    "functional_role": "It organizes autobiographical continuity and guides social positioning.",
    "symbolic_resonance": "Consolidates the Id-field framework anchored through Cx-field narratives.",
    "example": "Recognizing yourself as a caregiver and interpreting actions through that lens."
  },
  "Emotion Processing": {
    "definition": "Emotion processing interprets and responds to affective stimuli through limbic-prefrontal interactions, mapping valence and arousal states.",
    "functional_role": "It shapes adaptive responses, decision biases, and social signaling.",
    "symbolic_resonance": "Activates the A-field, modulating all other fields via affective tone.",
    "example": "Feeling relief after resolving a conflict and adjusting future interactions."
  },
  "Motivation / Drive": {
    "definition": "Motivation arises from mesolimbic dopaminergic circuits signaling incentive salience and goal pursuit tendencies.",
    "functional_role": "It energizes behavior, sustaining efforts toward desired outcomes.",
    "symbolic_resonance": "Charges the N-field vectors, propelling action through the G-field.",
    "example": "Persisting with training because you anticipate improvement before a competition."
  },
  "Reward / Valuation": {
    "definition": "Reward processing evaluates outcomes and reinforces behaviors via orbitofrontal-striatal computations of expected value.",
    "functional_role": "It shapes learning, preference formation, and adaptive choice.",
    "symbolic_resonance": "Tunes N-field valence gradients, informing R-field prioritization.",
    "example": "Experiencing satisfaction after completing a challenging task, reinforcing future effort."
  },
  "Empathy / Theory of Mind": {
    "definition": "Empathy and theory of mind comprise the ability to infer others’ emotions and mental states via temporoparietal and medial prefrontal networks.",
    "functional_role": "They facilitate social understanding, cooperation, and moral alignment.",
    "symbolic_resonance": "Bridges Id-field selfhood with social Cx-field harmonics.",
    "example": "Sensing a friend’s disappointment despite their polite smile and offering support."
  },
  "Social Cognition": {
    "definition": "Social cognition encompasses the perception, interpretation, and prediction of social cues and group dynamics through specialized cortical and subcortical systems.",
    "functional_role": "It guides interpersonal behavior, status navigation, and cultural learning.",
    "symbolic_resonance": "Interlaces R-field schemas with G-field collective resonance.",
    "example": "Reading the room during a meeting and adjusting your tone accordingly."
  },
  "Moral Reasoning": {
    "definition": "Moral reasoning evaluates actions against ethical norms, engaging prefrontal, temporoparietal, and limbic structures to balance harm, fairness, and intent.",
    "functional_role": "It governs value-based choices and social accountability.",
    "symbolic_resonance": "Aligns N-field valuation with T-field karmic trajectories within the Cx-field.",
    "example": "Choosing to return a lost wallet because it feels ethically obligatory."
  },
  "Spatial Cognition": {
    "definition": "Spatial cognition constructs mental maps and orientation using parietal and hippocampal circuitry to encode metric and relational properties of environments.",
    "functional_role": "It supports navigation, object manipulation, and spatial reasoning.",
    "symbolic_resonance": "Extends P-field geometry through T-field pathways for embodied presence.",
    "example": "Mentally plotting the fastest route through a city to reach a destination."
  },
  "Rhythm / Timing": {
    "definition": "Rhythm and timing perception coordinates temporal patterns via cerebellar, basal ganglia, and cortical synchrony.",
    "functional_role": "It underlies motor coordination, speech, and entrainment to external beats.",
    "symbolic_resonance": "Synchronizes T-field pulses with P-field sequencing.",
    "example": "Keeping tempo with a metronome while playing an instrument."
  },
  "Creativity / Divergence": {
    "definition": "Creativity involves generating novel, valuable ideas through interplay between default mode, executive control, and salience networks.",
    "functional_role": "It expands problem-solving repertoires and cultural innovation.",
    "symbolic_resonance": "Invokes divergent Cx-field branching informed by P-field recombination.",
    "example": "Combining disparate concepts to design an original product."
  },
  "Learning / Plasticity": {
    "definition": "Learning reflects experience-dependent neural plasticity, altering synaptic strengths and network configurations across cortical and subcortical regions.",
    "functional_role": "It encodes new knowledge and adapts behavior through reinforcement and consolidation.",
    "symbolic_resonance": "Adjusts N-field gradients and R-field structures, refining the Self-Clock lattice.",
    "example": "Improving performance after repeated practice of a skill."
  },
  "Dreaming / Imagery": {
    "definition": "Dreaming is the spontaneous generation of perceptual narratives during sleep, driven by intrinsic activity in limbic and associative cortices with reduced executive constraint.",
    "functional_role": "It may support memory consolidation, emotional processing, and creative integration.",
    "symbolic_resonance": "Unbounded Cx-field simulations traverse T-field and P-field interplay.",
    "example": "Experiencing a vivid nighttime scenario that blends memories with fantastical elements."
  },
  "Narrative / Meaning-Making": {
    "definition": "Narrative construction integrates events into coherent stories through default mode network operations linking episodic and semantic memory.",
    "functional_role": "It confers meaning, organizes identity, and communicates experience.",
    "symbolic_resonance": "Weaves Id-field continuity with Cx-field articulation across T-field arcs.",
    "example": "Reflecting on a challenging period and framing it as a turning point in personal growth."
  }
}
